```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # github_actions_secret.main["RELEASE_KEYSTORE_FILE"] must be replaced
-/+ resource "github_actions_secret" "main" {
      ~ created_at       = "2025-11-02 17:21:42 +0000 UTC" -> (known after apply)
      ~ id               = "playground.ashdavies.dev:RELEASE_KEYSTORE_FILE" -> (known after apply)
      ~ plaintext_value  = (sensitive value) # forces replacement
      ~ updated_at       = "2025-11-02 17:21:42 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
<!-- thollander/actions-comment-pull-request "terraform-plan" -->